// Operators
let lessons = 10;

lessons = 10 + 10; // 20
lessons = 10 - 5; // 5
lessons = 10 * 10; // 100
lessons = 10 / 10; // 1
lessons = 11 % 2; // 1 // остаток от деления 
// console.log(lessons);

// ---------------------------------
let x;
x = 2 ** 2; // возведение в степень // 4
x = 2 ** 3; // возведение в степень // 8

x = 1;
x = x + 1; // 2 // x++
x = x - 1; // 1 // x--

console.log(x);

// ---------------------------------

let a = 10;
let b = a++; // постфиксный инкремент 
// let b = a--; // постфиксный декремент

console.log(b); // 10
console.log(a); // 11

let c = 10;
let d = --c;    // префиксный декремент
// let d = ++c; // префиксный инкремент 

console.log(d); // 9
console.log(c); // 9

// ---------------------------------
// Операторы присваивания

let d1 = 10;
d1 = d1 + 1; 
d1 += 1; // сокращенный вариант 
// d1 -= 1;
// d1 *= 1;
// d1 /= 1;
// d1 %= 1;
// d1 **= 1;
console.log(d1); // 12

// Операторы сравнения
// >, <, >=, <=
// ==, ===, !=, !==

console.log(1 == 1); // true // нестрогое равенство 
console.log(1 === 1); // true // строгое равенство 

console.log(1 == '1'); // true // нестрогое равенство // сравнение числа с строкой
console.log(1 === '1'); // false // строгое равенство // сравнение числа с строкой
// в проектах всегда использовать === , == -> это уже устаревший вариант

console.log(1 != '1'); // false // нестрогое неравенство
console.log(1 !== '1'); // true // строгое неравенство
// в проектах всегда использовать !==

// ---------------------------------
// Конкатенация (объединения)
const greeting = 'Hello ' + 'World!';

console.log(greeting); // Hello World!
console.log(1 + 'hello'); // 1hello // string
console.log(1 + '1'); // 11 // string

